# Data preparation

## Setup

In [2]:
import pandas as pd

## Data

### Data import

In [3]:
df = pd.read_excel("6_1_raw_data.xlsx")

In [3]:
df.head()

,Year,Month,Our Company,Competitor A,Competitor B,Competitor C,Competitor D
0,2019,Jan,29.0,49,38,36,25
1,2019,Feb,29.0,48,39,37,25
2,2019,Mar,31.0,48,39,38,26
3,2019,Apr,34.0,47,38,37,24
4,2019,May,34.0,45,40,38,25

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Year          14 non-null     int64
 1   Month         14 non-null     object
 2   Our Company   14 non-null     float64
 3   Competitor A  14 non-null     int64
 4   Competitor B  14 non-null     int64
 5   Competitor C  14 non-null     int64
 6   Competitor D  14 non-null     int64
dtypes: float64(1), int64(5), object(1)
memory usage: 916.0+ bytes

### Data transformation

In [6]:
df['Our Company'] = df['Our Company'].astype('int64')

Prepare the date variable:

In [7]:
# Convert month abbreviations to numerical format
df['month'] = pd.to_datetime(df['Month'], format='%b').dt.month
# Create a new day variable
df['day'] = "1"
# Create Date
df["Date"] = pd.to_datetime(df[['Year', 'month', 'day']])

Next, we use the [melt](https://pandas.pydata.org/docs/reference/api/pandas.melt.html) function to prepare our data

In [8]:
df = df.melt(id_vars=['Date'], value_vars=['Our Company', 'Competitor A', 'Competitor B', 'Competitor C', 'Competitor D'], var_name='Company', value_name='nps')
df

         Date       Company  nps
0  2019-01-01   Our Company   29
1  2019-02-01   Our Company   29
2  2019-03-01   Our Company   31
3  2019-04-01   Our Company   34
4  2019-05-01   Our Company   34
..        ...           ...  ...
65 2019-10-01  Competitor D   28
66 2019-11-01  Competitor D   28
67 2019-12-01  Competitor D   29
68 2020-01-01  Competitor D   32
69 2020-02-01  Competitor D   32

[70 rows x 3 columns]

In [9]:
# Change format to upper case
df["Company"] = df["Company"].str.upper()

df.head()

        Date      Company  nps
0 2019-01-01  OUR COMPANY   29
1 2019-02-01  OUR COMPANY   29
2 2019-03-01  OUR COMPANY   31
3 2019-04-01  OUR COMPANY   34
4 2019-05-01  OUR COMPANY   34

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Date     70 non-null     datetime64[ns]
 1   Company  70 non-null     object
 2   nps      70 non-null     int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 1.8+ KB

In [11]:
df.to_csv("data.csv", index=None)